; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-1-293)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-0 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p3-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s0)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 56)
	(= (time-to-walk p1-0 s1) 56)
	(= (time-to-walk s0 p1-0) 17)
	(= (time-to-walk p1-0 s0) 17)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 18)
	(= (time-to-walk p2-0 s2) 18)
	(= (time-to-walk s0 p2-0) 18)
	(= (time-to-walk p2-0 s0) 18)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 52)
	(= (time-to-walk p2-1 s2) 52)
	(= (time-to-walk s1 p2-1) 10)
	(= (time-to-walk p2-1 s1) 10)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 14)
	(= (time-to-walk p2-3 s2) 14)
	(= (time-to-walk s3 p2-3) 10)
	(= (time-to-walk p2-3 s3) 10)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 10)
	(= (time-to-walk p3-0 s3) 10)
	(= (time-to-walk s0 p3-0) 51)
	(= (time-to-walk p3-0 s0) 51)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 38)
	(= (time-to-drive s2 s1) 38)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 16)
	(= (time-to-drive s3 s1) 16)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 13)
	(= (time-to-drive s2 s3) 13)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 19)
	(= (time-to-drive s1 s0) 19)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 57)
	(= (time-to-drive s3 s0) 57)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s1)
	(at truck1 s1)
	(at truck2 s1)
	(at package1 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 7
2. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 190
   goals met: 2 of 7
3. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 2 of 7
4. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 3 of 7
5. (walk driver4 s0 p1-0)
   deleted: (at driver4 s0)
   added: (at driver4 p1-0)
   goals met: 3 of 7
6. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 190 to 570
   goals met: 2 of 7
7. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 3 of 7
8. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 7
9. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 570 to 760
   goals met: 3 of 7
10. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 760 to 1140
   goals met: 2 of 7
11. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 7
12. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 7
13. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 1 of 7
14. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 1 of 7
15. (unload-truck package1 truck2 s2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 1 of 7
16. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 7
17. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   goals met: 1 of 7
18. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 1140 to 1283
   goals met: 1 of 7
19. (unload-truck package1 truck1 s3)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 7
20. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 1283 to 1443
   goals met: 3 of 7
21. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 7
22. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 1443 to 1633
   goals met: 2 of 7
23. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 2 of 7
24. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   goals met: 2 of 7
25. (walk driver4 p1-0 s0)
   deleted: (at driver4 p1-0)
   added: (at driver4 s0)
   goals met: 2 of 7
26. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 7
27. (drive-truck truck1 s0 s1 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 1633 to 1823
   goals met: 3 of 7
28. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 1823 to 2203
   goals met: 2 of 7
29. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 2 of 7
30. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   goals met: 3 of 7
31. (walk driver4 s2 p2-1)
   deleted: (at driver4 s2)
   added: (at driver4 p2-1)
   goals met: 3 of 7
32. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 7
33. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2203 to 2583
   goals met: 3 of 7
34. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 3 of 7
35. (walk driver2 s1 p2-1)
   deleted: (at driver2 s1)
   added: (at driver2 p2-1)
   goals met: 3 of 7
36. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 3 of 7
37. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 3 of 7
38. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 4 of 7
39. (walk driver4 p2-1 s2)
   deleted: (at driver4 p2-1)
   added: (at driver4 s2)
   goals met: 4 of 7
40. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 4 of 7
41. (walk driver2 p2-1 s2)
   deleted: (at driver2 p2-1)
   added: (at driver2 s2)
   goals met: 5 of 7
42. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 2583 to 2963
   goals met: 6 of 7
43. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 7 of 7
